Revit 2027 API
BuiltInFailures.SketchFailures.CannotComputeRailingsElevationWarn Property
 Can't compute Railings Elevation Profile
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotComputeRailingsElevationWarn { get; }
Public Shared ReadOnly Property CannotComputeRailingsElevationWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotComputeRailingsElevationWarn {
	FailureDefinitionId^ get ();
}
static member CannotComputeRailingsElevationWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace